{
    "Adventure" : "+FRONT_DOOR\n?\n{You are standing in front of the old hickory door of a run-down brick house. Around you is a forest of orange and red, and behind you is the one-way road that led you here. The door is unlocked.}\n\n!south\n{Though the road back seems quite inviting, you are here to complete a job. Why would you turn back?}\n\n@north=ENTRANCE\n\n////////////////////////////////////////////\n+ENTRANCE\n\n?<!hole_fixed>\n{On a vintage embroidered carpet, you stand in the house’s guestroom. Some rickety stairs lead up, with a hole too big to jump across. To your left is a nice aroma, and to your right is a large living room.}\n\n?<=hole_fixed>\n{On a vintage embroidered carpet, you stand in the house’s guestroom. Some rickety stairs, patched by an unsturdy wooden plank, lead up. In front of you is a nice aroma, and to your right is a large living room.}\n\n!south\n{The door is locked. Well, you locked it when you came in and it’s now stuck shut. Now look what you’ve done.}\n\n_plank!(@[up])\n{You place the plank on the stairs. It trembles a bit, but should work as a temporary staircase.}\n\n@up~=UPSTAIRS\n@west=KITCHEN\n@east=LIVING_ROOM\n\n////////////////////////////////////////////\n+KITCHEN\n?\n{You stand in a surprisingly well-kept kitchen. The counter is arranged with an array of empty plates, and the stove (electric) has some tin pans and pots. The window above the sink looks over a fenced-in garden with a greenhouse.}\n\n?<!pie_eaten>\n{A warm, aromatic butter pie lies on the counter, and below it a note that reads “for our chef :> ”.}\n\n?<=pie_eaten>\n{Next to the delicious pie, a notepad lies on the table. You need the ingredients:\n\nRed Wine\nThyme\nTomatoes\nGarlic\nOnions\nChicken}\n\n%pie!(=pie_eaten)\n{It’s probably for you? Well, one way or another, it smells great and you’re hungry. The creamy flavours melt into your mouth as you wolf it down. Why hire a chef if the food’s so good already? Out of the corner of your eye, you think you see a sparrow of some sort flutter away.\n\nAs you finish up the pie, your fork touches something hard. You scoop it out of the pie. A ballpoint pen. Huh.\n\nYou write the recipe down. Coq au Vin. It’s a traditional French braised chicken stew. Chicken. If the stories are true, then why would birds be eating… birds?}\n\n_seeds<!carl_met>\n{While you could use the pumpkin seeds for something like roasted seeds or pie, you’re not here for that.}\n\n_seeds!<=carl_met>(^[roasted_seeds])\n{There isn’t a fancy bird that can resist the scent of roasted seeds, you think. You batter up the pumpkin seeds in some butter, arrange them on a sheet, and let them bake in the oven at 300°F for 45 minutes.}\n\n@south=ENTRANCE\n@east=DINING_AREA\n\n/////////////////////////////////////////////////////\n+LIVING_ROOM\n?\n{The living room(?) is a bit cramped, to say the least. An array of books and rods litter the floor, and a scratched-up couch faces an Apple Pro Display XDR. Like, complete with Center Stage and everything. It’s playing the latest Mr. Beast video.\n\nTo your right, under a painting of a great egret, lies a closet door just wide enough to squeeze into. To your north, past some haphazardly placed coffee tables is what looks to be the dining area.}\n\n_carl\n{“Oh, this is the one with Karl Jacobs!”}\n\n@west=ENTRANCE\n@east=CLOSET\n@north=DINING_AREA\n/////////////////////////////////////////////////////\n+DINING_AREA\n?\n{Under the lights of flickering candles above, you face a cluttered table, littered with more books and trash. Surprisingly, this room is quite large with many of these tables and chandeliers. If it weren’t for all the clutter, it would probably resemble a high-end restaurant. Natural light streams through windows facing the backyard, overgrown with vines but lit by torchlight.}\n\n?<![seeds]>\n{A neat packet of pumpkin seeds lies on the floor.}\n\n?\n{To your right, more light leaks from a wider room with some doors.}\n\n^seeds\n{You take the pumpkin seeds. They won’t be in the Coq au Vin you’re making, but you never know.}\n\n@west=KITCHEN\n@east=SOLARIUM\n@south=LIVING_ROOM\n/////////////////////////////////////////////////////\n+CLOSET\n\n?<!breakers_on>\nThe closet is cramped, but tall. It’s too dark to see anything, but there’s a light. Out of power, probably.\n\n?<=breakers_on![red_wine]>\n{The closet is cramped, but tall. Looking up, you spot some red wine. But it’s just out of reach. You’ll need something to grab it with.}\n\n?<=breakers_on=[red_wine]>\n{The closet is cramped, but tall. Looking up, you see an empty shelf.}\n\n^wine!<=breakers_on>\n{It’s out of reach.}\n\n^wine<=[rake]=breakers_on>\n{You carefully raise the rake and use its tip to lightly knock over the red wine. Just before it can hit the floor, you catch it with your left hand. Nice!}\n\n_carl<!breakers_on>\n{“Turn on the lights, fool!”}\n\n_carl<![wine]>\n{“You think I can reach that? Get something to grab it with, fool!”}\n\n_carl<={-[wine]}\n{“Nice catch.”}\n\n@east=LIVING_ROOM\n\n/////////////////////////////////////////////////////\n+SOLARIUM\n?\n{Entering the room, you’re greeted with a stream of bright light. Above you is a wide glass skylight, with a window propped open. There are some tables and fridges on the side, and a furry tan carpet covers the floor.\n\nAhead of you is a glass door leading to the porch, and a nearby staircase leads down into the basement.}\n\n@north=PATIO\n@down=BASEMENT_STAIRS\n@west=DINING_AREA\n\n/////////////////////////////////////////////////////\n+PATIO\n\n?<!breakers_on>\nYou stand on the wooden patio, which of all things has been recently pressure-washed. Above you, plenty of garden lights are strung in a wave pattern but have not been turned on.\n\n?<=breakers_on>\n{You stand on the wooden patio, which of all things has been recently pressure-washed. A tapestry of orange lights glitter as strings above you, a single moth fluttering about.}\n\n?<!carl_met>\n{On the chimney of the building, you see the most chill chicken in your life.\n\n“Top o’ the morning, you down there! How goes the sunrise? Truly a beauty. If you are here on business concerns, I’ll be down when the party starts!”\n\nWhile the chicken is quite dapper, you get the sense that he can’t see you very well. Maybe the chicken can give you some useful information about where to get the ingredients. If he came down.}\n\n?<=carl_met>\n{“I’ll be down later! Toodaloo!” shouts the chicken.\n\nYou get the sense that the chicken is ignoring you. Maybe the chicken can give you some useful information about where to get the ingredients. If he came down.}\n\n?<=seeds_tossed>\n{You see the stately chicken minding his own business with the seeds.}\n\n_seeds\n{You take out some seeds and toss them up at the chicken. He doesn’t seem to notice.}\n\n_roasted_seeds!\n{You scatter some roasted seeds over the patio. Little did the chicken know, nobody can ignore the scent or roasted seeds.\n\nWithout a doubt, the chicken comes down to investigate the seeds. “Ooh, has the party started?” It’s surprising how he hasn’t noticed you yet. You should probably capture him, but bare hands probably won’t do.}\n\n_apron!(^[carl])\n{Cluck! You take off your apron and pounce on the chicken, now a ball of wiggling white cloth. Standing up, you carefully unfold a small part of the apron and the chicken pops his head through.\n\n“Hello! Nice to meet you! I’m Carl,” he says, with eyes wide open. “How goes your day?” You decide to tell him about the meal, leaving out the chicken part.\n\n“Oh, I’m sure I can help! Ask me if you need anything. But by name! I’m not a chicken,” he says. Then falls asleep. Okay then.}\n\n_carl\n{“Those seeds on the floor look very good…”}\n\n@west=FOUNTAIN\n@south=SOLARIUM\n\n/////////////////////////////////////////////////////\n+FOUNTAIN\n\n?\n{A ceremonial fountain lies at the centre of the yard. Looking around you, you see a circle of torches, all burning brightly. To the north is a small stone path leading to a greenhouse.\n\nThere is an inscription on the side of the fountain.}\n\n?<![rake]>\n{A rake leans against the fountain.}\n\n^rake\n{You take the rake. Maybe this will be useful in the future.}\n\n^torch\n{You grab a torch and extinguish it.}\n\n%inscription\n{To our founder, Eldric. Each morning, he rose with unwavering resolve to follow the rising sun, believing it would guide him to fortune. Yet day after day, the sun never returned to him his kindness. Yet, one day, he noticed a flock of birds soaring high above, as if inviting him. Following the birds, he soon discovered a glade where sunlight poured down like liquid gold over a single magnificent apple gleaming on the bough. With trembling hands, he plucked the fruit. The founder apple, as it was called, has been passed down across the generations that bear our home.}\n\n_carl<![rake]>\n{“Watch out! If you step on that rake it will attack back!”}\n\n_carl<-[rake]>\n{“That inscription is probably the hint to a puzzle of some sort.”}\n\n@north=GREENHOUSE_DOOR\n@east=PATIO\n\n/////////////////////////////////////////////////////\n+GREENHOUSE_DOOR\n\n?<!greenhouse_unlocked>\n{You stand in front of a stained glass door. Inside of it seem to be the plants you need. It has a number lock, each number being 1-5. Looking inside, you see the plants numbered:\n1) Garlic\n2) Tomatoes\n3) Thyme\n4) Grain\n5) Onions}\n\n?<=greenhouse_unlocked>\n{You stand in front of a stained glass door. It’s unlocked, and you sense warmth radiating from it.}\n\nif(loc = “GREENHOUSE_DOOR”)\n{You input the sequence and try the lock. It doesn’t budge.}\n\n%43521(@[north])\n{You input the sequence and try the lock… and to your surprise, it works! You push the door in front of you slightly open and you feel a small wave of heat pass by you.}\n\n_carl<!greenhouse_unlocked>\n{“There hasn’t been anyone who used the greenhouse for a while, so I decided to lock the door. Unfortunately, I’ve forgotten the password, but I think it has to do with the numbers of the plants and a note I’ve written upstairs somewhere.”}\n\n_carl<=[letter]>()\n{“Oh, the note! Here, give me your pen.” You hold up the pen and begin to question how a chicken would hold a pen when he grabs it with his beak and somehow underlines three words. “Here, look at it again.”}\n\n_carl<=[annotated_letter]>:\n{“Look at the note, fool!”}\n\n@north~=GREENHOUSE\n@south=FOUNTAIN\n\n/////////////////////////////////////////////////////\n+UPSTAIRS\n?\n{In a wooden room, you stand on a carpeted area. On the northwest edge, there is a balcony overlooking the candle-lit kitchen. It feels warm up here, and you want to sit down for a bit.}\n\n?<!breakers_on>\n{To your right is a breaker box.}\n\n%breaker!\n{On closer inspection, the lights to the closet, backyard, and basement are off. Turning them on, you hear a rising hum from downstairs.}\n\n@north=BEDROOM\n@down=ENTRANCE\n\n/////////////////////////////////////////////////////\n+BEDROOM\n?\n{The bedroom is a cosy loft with soft jazz music playing in the background. While it is fit with windows, a desk, and wooden rafters, there isn’t a bed in sight. Strange.}\n\n?<!letter_taken>\n{On the desk, you spot a note scrawled in neat cursive.}\n\n^letter(=letter_taken)\n{You take the note. It says:\n“T’is a warning to my neighbour. Verily, cows graze upon thy neighbour’s plants, by your reflecting pond.”\n\nWhy so archaic? Though, you glance through the bedroom window and you indeed do see cows absolutely devouring the crops. You pocket the note.}\n\n_carl<!letter_taken>\n{“Oh, there’s that letter I mentioned. I’m pretty sure I wrote something helpful in it somewhere.!”}\n\n_carl<=letter_taken>\n{“Give me your pen.” You hold up the pen and begin to question how a chicken would hold a pen when he grabs it with his beak and somehow underlines three words. “Here, look at it again.”}\n\n@south=UPSTAIRS\n\n/////////////////////////////////////////////////////\n+GREENHOUSE\n?\n{You step into the greenhouse and are greeted by warm air, with a hint of the scent of dirt. From the windows, sunlight streams through, casting soft patterns across the vibrant plants. Other than Carl’s ruffling, the space is calm and serene.\n\nAll the plants you could possibly need are here.}\n\n^tomato\n{You grab a tomato. You turn it around in your hand. It’s pretty hearty, and... surprisingly large. More like a cantaloupe... Huh.\n\nYou pocket it.}\n\n^garlic\n{You reach into some of the submerged pots and pull out some onions. Shaking off the dirt, you can’t help but note that you can already smell them somewhat.\n\nYou pocket them.}\n\n^grain\n{You take some grains. You didn’t see any flour anywhere, but you should be able to make some yourself.\n\nYou pocket the grains.}\n\n^onions\n{You uproot some onions, carefully avoiding pulling up too much dirt. They’re fat and bulbous, almost like apples.\n\nYou cut the stalks off and pocket them.}\n\n^thyme\n{The thyme comes off with a good yank. It’s a bit rough to the touch and tickles your hand as you rub it.\n\nYou pocket the thyme.}\n\n%apple\n{You dig around until you notice a large orange apple glistening in the garden lights. You sense a presence coming from it, as if you should leave it alone.\n\nThat’s what you decide to do.}\n\n@south=GREENHOUSE_DOOR\n\n/////////////////////////////////////////////////////\n+BASEMENT_STAIRS\n\n?<!torch_lit>\n{You begin to descend the creaking wooden stairs. However, darkness presses in from all sides, making it impossible to see anything at all. You’ll have to find a light and come back.}\n\n?<=torch_lit>\n{Your torchlight flickers, revealing the basement stairs as uneven and splintered. Shadows shift across the stone walls, showing damp patches and cobwebs hanging in the corners.}\n\n?<=breakers_on>\n{You notice some sparks glancing across the bottom of the stairs. The basement lights are probably broken, so you’ll need a different light...}\n\n_torch<!torch_lit>(=torch_lit@[down])\n{You strike the yard torch and the dry wood crackles as a small flame flickers on. The warm glow pushes back the darkness just enough to reveal the rough stone walls and stairs.}\n\n@up=SOLARIUM\n@down~=BASEMENT\n\n/////////////////////////////////////////////////////\n+BASEMENT\n\n?<!torch_burnt>\n{At the bottom of the stairs, you enter a dark basement lit by the flickering light of your torch. A large, rusted door stands against one wall, and beside it are three levers mounted on the stone, left to right. The first has a golden inscription of an apple underneath it, but the other two inscriptions are unclear.\n\nFrom left to right, each lever is referred to as one, two, or three. Type “reset” flip all levers off.}\n\n?<=torch_burnt>\n{At the bottom of the stairs, you enter a dark basement lit by the flickering light of your torch. A large, rusted door stands against one wall, and beside it are three levers mounted on the stone, left to right. The first has a golden inscription of an apple underneath it.\n\nThe second has a red inscription of the sun under it, but the last inscription is unclear.\n\nFrom left to right, each lever is referred to as one, two, or three. Type “reset” flip all levers off.}\n\n_carl<!basement_door_open>\n“The third lever… he squints. That one reminds me of something. Go read the inscription… there’s a pattern of some sort in there.”\n\n_carl<=basement_door_open>\n“Oh! Just... be careful when handling him.”\n\n_torch<!torch_burnt>\n{You hold the torch up to the levers to maybe get a closer look, when suddenly, the inscription on the second one becomes clear. The sun.}\n\n%one<!1f!2f!3f>\n{You flip the first lever.}\n\n%one<!1f=2f=3f=2first=3secnd>(@[north])\nYou grasp the handle of the last lever and pull it down with a firm tug. There’s a loud click, followed by a series of mechanical whirs that echo through the basement. The rested door creaks open softly, revealing a dark corridor beyond. \n\n%one<!1f=2f=3f>(!3secnd!2first)\nYou flip the first lever. You hear a large creaking mechanism as all the levers turn off. That didn’t work.\n\n/////////////\n\n%two<!torch_burnt>\n{The lever won’t budge, as if blocked by some unknown force. You need to present an item of some sort to it so it can budge.}\n\n%two<=torch_burnt!1f!2f!3f>(=2first)\n{You flip the second lever.}%\n\n%two<=1f!2f=3f>(!3secnd!2first)\nYou flip the first lever. You hear a large creaking mechanism as all the levers turn off. That didn’t work.\n\n/////////////\n\n%three<!1f=2f!3f>(=3secnd)\n{You flip the third lever.}\n\n%three<=1f=2f!3f>(!3secnd!2first)\nYou flip the first lever. You hear a large creaking mechanism as all the levers turn off. That didn’t work.\n\n/////////////\n\n%reset(!1f!2f!3f!3secnd!2first)\nYou flip the first lever again. You hear a large creaking mechanism as all the levers turn off.\n\n@north~=PRECIPICE\n@up=BASEMENT_STAIRS\n\n/////////////////////////////////////////////////////\n+PRECIPICE\n\n?\n{At the end of the corridor, you stand before a large, gaping hole in the floor, its edges rough and crumbling. Peering into the abyss, you can’t see the bottom. Only an impenetrable darkness yawns below, as if it could swallow your torchlight whole.}\n\n?<!ladder_used>\n{Next to the hole, a long rope ladder lies coiled, its fibres frayed and worn, suggesting it hasn‘t been used in centuries.}\n\n%ladder!<!ladder_used>(=ladder_used@down)\n{You grab the long rope ladder and carefully uncoil it. With a firm grip, you drop one end into the hole, watching it disappear into the dark as it falls.}\n\n@down~=FREEZER\n@south=BASMENT\n\n/////////////////////////////////////////////////////\n+FREEZER\n\n?\n{A chill descends upon you as your shoes click against the floor. It’s dark and damp - as if the shadows are trying to swallow up what little light you have. The walls around you seem to be growing taller and taller, feeling as if you are in a stone cage. Looking forwards, you notice your torchlight casts orange rays over what appears to be a large stone coffin.}\n\n?<=coffin_open=chicken_taken>\n{On the coffin lies a pile of wilted flowers, the occupant now gone. Why such a stately chamber for... a chicken of all things?}\n\n?<=coffin_open!chicken_taken>\n{On the open coffin lies the red junglefowl. You... I guess you finally found the chicken, huh?}\n\n%coffin!(=coffin_open)\n{You slowly bust the lid off the coffin. With a large grunt, you lift it off, a cloud of dust and ashes billowing into a haze of white around you. The inside is surprisingly pristine, a gorgeous orange blanket covering a slightly rotund lump.\n\nYou carefully remove the sheets. Underneath, you find... a red junglefowl. From the looks of it, it’s very old. And surprisingly well preserved.}\n\n^chicken\n{You slowly pick up the junglefowl, sighing. All that for this...? You turn the junglefowl around in your hands. It’s surprisingly large. It should be able to serve a lot of people.\n\nYou glance down at Carl, still sleeping soundly. How would he react...?}\n\n_carl\n{Carl is sleeping. He has feathers (and you don’t) so he should be fine.}\n\n@up=PRECIPICE\n/////////////////////////////////////////////////////"
}